/**
 * 圣诞和斋日
 *
 * Created by senntyou on 2017/1/10.
 */

// 斋日和菩萨圣诞日
define(function() {
  var feastAndBirth = {
    /**
     * 菩萨圣诞日
     *     format: {
     *         month.day : string/array
     *     }
     * @type {{}}
     */
    birthDays: {
      '1/1': '弥勒菩萨圣诞',
      '1/6': '定光古佛圣诞',
      '2/8': '释迦牟尼佛出家',
      '2/9': '惠能大师圣诞',
      '2/15': '释迦牟尼佛涅槃',
      '2/19': '观世音菩萨圣诞',
      '2/21': '普贤菩萨圣诞',
      '3/16': '准提菩萨圣诞',
      '4/4': '文殊菩萨圣诞',
      '4/8': '释迦牟尼佛圣诞',
      '4/15': '佛吉祥日',
      '4/28': '药王菩萨圣诞',
      '5/13': '伽蓝菩萨圣诞',
      '6/3': '护法韦驮菩萨圣诞',
      '6/19': '观世音菩萨成道日',
      '7/13': '大势至菩萨圣诞',
      '7/15': '佛欢喜日',
      '7/24': '龙树菩萨圣诞',
      '7/29': '地藏菩萨圣诞',
      '8/22': '燃灯佛圣诞',
      '9/19': '观世音菩萨出家',
      '9/30': '药师琉璃光佛圣诞',
      '10/5': '达摩大师圣诞',
      '11/17': '阿弥陀佛圣诞',
      '12/8': '释迦牟尼佛成道',
      '12/29': '华严菩萨圣诞',
    },
    /**
     * 十日斋（大月）
     * @type {{}}
     */
    tenDay: {
      '1': true,
      '8': true,
      '14': true,
      '15': true,
      '18': true,
      '23': true,
      '24': true,
      '28': true,
      '29': true,
      '30': true,
    },
    /**
     * 十日斋（小月）
     * @type {{}}
     */
    tenDayOfSmall: {
      '1': true,
      '8': true,
      '14': true,
      '15': true,
      '18': true,
      '23': true,
      '24': true,
      '27': true,
      '28': true,
      '29': true,
    },
    /**
     * 六日斋（大月）
     * @type {{}}
     */
    sixDay: {
      '8': true,
      '14': true,
      '15': true,
      '23': true,
      '29': true,
      '30': true,
    },
    /**
     * 六日斋（小月）
     * @type {{}}
     */
    sixDayOfSmall: {
      '8': true,
      '14': true,
      '15': true,
      '23': true,
      '28': true,
      '29': true,
    },
    /**
     * 朔望斋
     */
    shuoWangDay: {
      '1': true,
      '15': true,
    },
    /**
     * 观音斋
     */
    guanYinDay: {
      '1/8': true,
      '2/7': true,
      '2/9': true,
      '2/19': true,
      '3/3': true,
      '3/6': true,
      '3/13': true,
      '4/22': true,
      '5/3': true,
      '5/17': true,
      '6/16': true,
      '6/18': true,
      '6/19': true,
      '6/23': true,
      '7/13': true,
      '8/16': true,
      '9/19': true,
      '9/23': true,
      '10/2': true,
      '11/19': true,
      '11/24': true,
      '12/25': true,
    },
  };
  return feastAndBirth;
});
